sample_app/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "わわわ"], ["body", "わわわわー"], ["created_at", "2018-11-13 04:15:49.589243"], ["updated_at", "2018-11-13 04:15:49.589243"]]
---
  	def create
  		#ストロングパラメータを使用
  		post = Post.new(post_params)
  		#DBへ保存する
  		post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "てすとなんだよ"], ["updated_at", "2018-11-13 08:08:39.357113"], ["id", 2]]
---
  def update
  	post = Post.find(params[:id])
  	post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
  def destroy
    post = Post.find(params[:id])
    post.destroy